<h1>Добро пожаловать!</h1>
<p>
<img src="/images/illustration.png" align="left" >
Архитектура микросервисов, также известная как «микросервисы», представляет собой подход к созданию приложения в виде набора независимо развертываемых сервисов, которые децентрализованы и разрабатываются автономно. Эти сервисы слабо связаны, независимо развертываются и легко обслуживаются. В то время как монолитное приложение строится как единая неделимая единица, микросервисы разбивают эту единицу на набор независимых единиц, которые вносят вклад в большее целое. Микросервисы — неотъемлемая часть DevOps, поскольку они являются основой для методов непрерывной доставки , которые позволяют командам быстро адаптироваться к требованиям пользователей.
</p>

<p>
Микросервис — это веб-сервис, отвечающий за одну часть доменной логики. Несколько микросервисов объединяются для создания приложения, каждый из которых предоставляет определенную функциональность для домена. Микросервисы взаимодействуют друг с другом с помощью API, таких как REST или gRPC, но не знают о внутренней работе других сервисов. Гармоничное взаимодействие между микросервисами и есть микросервисная архитектура.
</p>