<h1>Сервисы</h1>

<p>
Сервис-ориентированная архитектура (SOA) и микросервисы — это два типа архитектур веб-сервисов. Подобно микросервисам, SOA состоит из повторно используемых специализированных компонентов, которые работают независимо друг от друга. Различие между двумя типами архитектуры заключается в бюрократической классификации типов услуг.
</p>

<p>
Эти типы определяют связанную с доменом ответственность базовых служб. Для сравнения, микросервисы имеют только два типа сервисов: функциональные и инфраструктурные.
</p>

<p>
Обе архитектуры используют один и тот же набор стандартов на разных уровнях предприятия. Существование архитектуры микросервисов сводится к успеху шаблона SOA. Следовательно, шаблон архитектуры микросервисов является подмножеством SOA. Здесь основное внимание уделяется автономности каждого сервиса во время выполнения.
</p>

<p>
Формального определения архитектуры микросервисов не существует, но есть некоторые общие шаблоны или характеристики, которые важно знать.
</p>